<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"0f9d55a941341edcf46f11c6a2c80d59d71ad3624e7ea866071e1c6968313f3a","plan_job_ref":"Job TF Plan #20 at https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4732786514","plan_hash":"6522756d710cb213f30785c244e1a258099427518c6096ddf3a521f2f725b123","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __secure-linux-jump__
With backend config: `resource_group_name=ampe-state-sandbox-resourcegroup-nwqlx-rg
storage_account_name=ampestatesandboxsadojob
container_name=ampe-state-sandbox-sc-ndkad-stct
key=slj.terraform.tfstate`
<details>
<summary>Plan: 24 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurenoopsutils_resource_name.LinuxJB will be created
  + resource "azurenoopsutils_resource_name" "LinuxJB" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "linux-JB"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_linux_virtual_machine"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.azbas will be created
  + resource "azurenoopsutils_resource_name" "azbas" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "azure-bastion"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_bastion_host"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.bas-pip will be created
  + resource "azurenoopsutils_resource_name" "bas-pip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "bas-pip"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.hub_nsg will be created
  + resource "azurenoopsutils_resource_name" "hub_nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "hub_nsg"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.hub_rg will be created
  + resource "azurenoopsutils_resource_name" "hub_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "Hub-Resourcegroup"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.hub_vnet will be created
  + resource "azurenoopsutils_resource_name" "hub_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "hub_vnet"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.linux_nsg will be created
  + resource "azurenoopsutils_resource_name" "linux_nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "linux_nsg"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.linux_rg will be created
  + resource "azurenoopsutils_resource_name" "linux_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "Linux-Resourcegroup"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.linux_snet will be created
  + resource "azurenoopsutils_resource_name" "linux_snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "linux_snet"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.linux_vnet will be created
  + resource "azurenoopsutils_resource_name" "linux_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "linux-vnet"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurenoopsutils_resource_name.linuxnic will be created
  + resource "azurenoopsutils_resource_name" "linuxnic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "linux-vm"
      + passthrough   = false
      + prefixes      = [
          + "AMPE",
          + "dev",
          + "linux-vm",
        ]
      + random_length = 5
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = []
      + use_slug      = true
    }

  # azurerm_bastion_host.azbas will be created
  + resource "azurerm_bastion_host" "azbas" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = (known after apply)
      + resource_group_name    = (known after apply)
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_linux_virtual_machine.linuxjb will be created
  + resource "azurerm_linux_virtual_machine" "linuxjb" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = "linux-vmjump"
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = (known after apply)
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = (known after apply)
      + size                            = "Standard_F2"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.jbnic will be created
  + resource "azurerm_network_interface" "jbnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.nicNSG will be created
  + resource "azurerm_network_interface_security_group_association" "nicNSG" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.hub_nsg will be created
  + resource "azurerm_network_security_group" "hub_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "initial-testing"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_network_security_group.linuxnsg will be created
  + resource "azurerm_network_security_group" "linuxnsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "initial-testing"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.hub-bas-pip will be created
  + resource "azurerm_public_ip" "hub-bas-pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_subnet.bastionsnet will be created
  + resource "azurerm_subnet" "bastionsnet" {
      + address_prefixes                               = [
          + "10.0.0.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # azurerm_subnet.linuxsnet will be created
  + resource "azurerm_subnet" "linuxsnet" {
      + address_prefixes                               = [
          + "10.1.0.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = (known after apply)
    }

  # azurerm_virtual_network.hub_vnet will be created
  + resource "azurerm_virtual_network" "hub_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
    }

  # azurerm_virtual_network.jumpvnet will be created
  + resource "azurerm_virtual_network" "jumpvnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
    }

  # module.hub_rg.azurerm_resource_group.main_rg will be created
  + resource "azurerm_resource_group" "main_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = (known after apply)
      + tags     = {
          + "env"      = "dev"
          + "workload" = "linux-vm"
        }
    }

  # module.jump_rg.azurerm_resource_group.main_rg will be created
  + resource "azurerm_resource_group" "main_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = (known after apply)
      + tags     = {
          + "env"      = "dev"
          + "workload" = "linux-vm"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #20](https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4732786514)